{
  "backend/main.mo": "Defines core actor data types and state maps for maintenance, expenditures, complaints, notices, visitor requests, users, and notifications, along with helper authorization and validation logic.",
  "feature_evidence.json": "Contains feature evidence metadata linking features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of multiple frontend files describing their purpose and recent changes.",
  "frontend/deploy/ic-deploy-with-retry.sh": "Shell script wrapping dfx deploy with cycles readiness checks, retry logic, and detailed error handling.",
  "frontend/deploy/ic-precreate-canisters.sh": "Shell script that pre-creates backend and frontend canisters on IC mainnet to avoid CaLM reservation issues.",
  "frontend/deploy/README.md": "Documentation describing IC mainnet deployment helper tools and the retry-enabled deployment script.",
  "frontend/docs/deployment-troubleshooting.md": "Troubleshooting guide covering common IC deployment issues, prerequisites, and wallet/cycles checks.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color tokens, theming variables, and dark mode values.",
  "frontend/index.html": "HTML entry page with PWA metadata and a styled startup fallback loader.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA settings, icons, colors, and metadata.",
  "frontend/public/sw.js": "Service worker handling caching, fetch routing, and offline fallbacks for app assets and navigation.",
  "frontend/src/App.tsx": "Main React app setup with routing, authentication via Internet Identity, profile loading, and startup signaling.",
  "frontend/src/components/FatalStartupErrorScreen.tsx": "UI screen showing a fatal startup error with reload and hard-reload actions.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout component handling navigation, user profile, notifications, PWA install prompts, and logout, with responsive mobile menu and dynamic logo loading.",
  "frontend/src/components/layout/DashboardCard.tsx": "Reusable card component displaying an icon, title, optional description, actions, and children with variant styling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, role, and optional flat number validation.",
  "frontend/src/components/StartupErrorBoundary.tsx": "Error boundary capturing early startup errors and rendering the fatal startup screen.",
  "frontend/src/components/StartupErrorScreen.tsx": "Recoverable startup error UI offering retry, logout, and hard reload options.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/usePwaInstall.ts": "Handles browser PWA installation prompts and exposes installability state and an install trigger.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, maintenance, payments, notifications, and other domain data.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, layout defaults, responsive text rules, and print-specific styling.",
  "frontend/src/main.tsx": "Application entry point initializing React, the query client, and the Internet Identity provider before rendering App.",
  "frontend/src/pages/ChangePasswordPage.tsx": "Provides a password change form with validation, mutation handling, and redirects after successful update.",
  "frontend/src/pages/common/NoticeDetailPage.tsx": "Displays full details of a selected notice, including title, message, and expiry, with a back-navigation button.",
  "frontend/src/pages/common/NoticesPage.tsx": "Lists all notices with sorting, secretary-only actions (CSV, print, create), and navigation to notice details.",
  "frontend/src/pages/common/NotificationsPage.tsx": "Shows unread and read notifications with options to mark one or all as read and formats timestamps for display.",
  "frontend/src/pages/flat/ComplaintDetailPage.tsx": "Shows detailed information for a flat-specific complaint, including status, priority, and resolution notes.",
  "frontend/src/pages/flat/ComplaintsPage.tsx": "Provides a form to lodge new complaints and displays existing complaints for the user's flat.",
  "frontend/src/pages/flat/ExpendituresPage.tsx": "Shows a placeholder page indicating expenditure tracking is unavailable due to missing backend support.",
  "frontend/src/pages/flat/FlatDashboardPage.tsx": "Displays the flat's main dashboard with quick links to maintenance, expenditures, complaints, notices, visitor requests, and profile management.",
  "frontend/src/pages/flat/MaintenancePage.tsx": "Allows users to view maintenance status, pay via UPI, and record payment details for selected months and years.",
  "frontend/src/pages/flat/ProfilePage.tsx": "Lets residents view, add, edit, and remove up to four mobile numbers tied to their flat profile.",
  "frontend/src/pages/flat/VisitorRequestsPage.tsx": "Shows visitor requests for the user's flat and enables approving or declining them with flat number validation.",
  "frontend/src/pages/guard/GuardDashboardPage.tsx": "Guard-focused dashboard showing pending visitor requests and navigation to create requests or view notices.",
  "frontend/src/pages/guard/VisitorRequestCreatePage.tsx": "Form page for guards to create visitor requests, validate fields, submit via mutation, and open a WhatsApp approval message.",
  "frontend/src/pages/guard/VisitorRequestDetailPage.tsx": "Displays details of a specific visitor request with status, flat info, and navigation back to the list.",
  "frontend/src/pages/guard/VisitorRequestsPage.tsx": "Lists all visitor requests with status badges, supports navigation to details, and links to create new requests.",
  "frontend/src/pages/LoginPage.tsx": "Implements the login screen using Internet Identity with error handling and optional custom logo loading.",
  "frontend/src/pages/secretary/ComplaintsAdminPage.tsx": "Admin dashboard for viewing, exporting, and printing all complaints with summary stats.",
  "frontend/src/pages/secretary/ComplaintsReportPrintPage.tsx": "Print-friendly page rendering all complaints with counts and triggers auto-printing.",
  "frontend/src/pages/secretary/components/SettingsSkeleton.tsx": "Skeleton loading UI for the secretary settings page, showing placeholder cards for logo and configuration sections.",
  "frontend/src/pages/secretary/CreateNoticePage.tsx": "Form for creating notices with optional expiry date and submitting via mutation.",
  "frontend/src/pages/secretary/ExpendituresAdminPage.tsx": "Page for recording, editing, exporting, and printing monthly expenditure entries with dynamic item management.",
  "frontend/src/pages/secretary/ExpendituresReportPrintPage.tsx": "Print-friendly view that loads a month's expenditures and triggers browser print once data is ready.",
  "frontend/src/pages/secretary/NoticesReportPrintPage.tsx": "Print view that loads all notices, sorts them by ID, and displays them in a table before auto-printing.",
  "frontend/src/pages/secretary/OverduePage.tsx": "Displays overdue flats for a selected period with month/year filters and overdue-period warnings.",
  "frontend/src/pages/secretary/PaymentsPage.tsx": "Management page showing payment status for all flats with CSV export and print options.",
  "frontend/src/pages/secretary/PaymentsReportPrintPage.tsx": "Print-friendly report showing payment statuses for all flats for a chosen month and year.",
  "frontend/src/pages/secretary/SecretaryDashboardPage.tsx": "Dashboard linking to payments, overdue, expenditures, complaints, notices, and settings sections with quick stats.",
  "frontend/src/pages/secretary/SettingsPage.tsx": "React page for managing secretary settings, including logo upload, form state, validation, and saving updates. Handles dirty detection and syncing with fetched settings.",
  "frontend/src/utils/csv.ts": "Utilities to escape CSV fields, generate CSV text from objects, and trigger CSV downloads in the browser.",
  "frontend/src/utils/dates.ts": "Date helpers for current month/year, formatting timestamps, listing months, and generating a small year range.",
  "frontend/src/utils/flatNumbers.ts": "Generates and validates society flat numbers within defined ranges and formats them for display.",
  "frontend/src/utils/hardReload.ts": "Clears caches and service workers then forces a full page reload.",
  "frontend/src/utils/overdue.ts": "Determines if the current date is overdue and whether an overdue notice should be shown.",
  "frontend/src/utils/print.ts": "Opens a print view in a new tab and triggers the browser print dialog.",
  "frontend/src/utils/sanitizeError.ts": "Sanitizes error messages by extracting safe text, truncating long content, and redacting sensitive patterns.",
  "frontend/src/utils/settingsValidation.ts": "Validation helpers for secretary settings fields and normalization utilities for consistent comparison.",
  "frontend/src/utils/upi.ts": "Builds a UPI deep link for payments using a UPI ID, amount, and note.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including hash‑based routing support.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp deep link using a cleaned phone number and encoded message.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing a fix request for secretary settings not saving due to incorrect dirty-check logic."
}