{
  "backend/main.mo": "Defines core actor with types, authorization mixins, approval workflows, persistent maps for all entities, ID counters, and helper/validation methods.",
  "feature_evidence.json": "Lists feature evidence records linking features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains pre-written summaries of multiple frontend files describing their functions and behaviors.",
  "frontend/deploy/ic-deploy-with-retry.sh": "Bash script wrapping dfx deploy with retries, cycles/wallet readiness checks, and detailed error handling.",
  "frontend/deploy/ic-precreate-canisters.sh": "Bash script that pre-creates backend and frontend canisters on IC mainnet to prevent CaLM reservation failures.",
  "frontend/deploy/README.md": "Explains IC mainnet deployment helper scripts, their purpose, features, and usage instructions.",
  "frontend/docs/deployment-troubleshooting.md": "Provides troubleshooting steps and prerequisites for resolving IC mainnet deployment issues.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark OKLCH palettes and applying global styles.",
  "frontend/index.html": "Main HTML entry with PWA meta tags, manifest links, icons, and root mount point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme, categories, and display properties.",
  "frontend/public/sw.js": "Service worker providing basic offline caching, fetch handling, and cache cleanup.",
  "frontend/src/App.tsx": "Sets up routing, authentication state, profile loading logic, and startup flows including login, errors, and profile setup.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header, navigation, logout logic, and PWA install support based on user role.",
  "frontend/src/components/layout/DashboardCard.tsx": "Reusable dashboard card component with icon, title, optional actions, and styling variants.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a new user profile with validation and submit logic.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays an error screen with retry, logout, and hard reload actions when startup data fails to load.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/clear functions, and loads identities via AuthClient.",
  "frontend/src/hooks/usePwaInstall.ts": "Hook that manages detecting and triggering PWA installation via beforeinstallprompt.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, authentication, maintenance records, payments, notices, and UPI ID actions via an actor API.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables, dark mode, mobile tweaks, and print rules.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, rendering the root App component.",
  "frontend/src/pages/ChangePasswordPage.tsx": "Provides a password change form with validation, mutation handling, and logout on success.",
  "frontend/src/pages/common/NoticeDetailPage.tsx": "Displays detailed information for a single notice based on route params.",
  "frontend/src/pages/common/NoticesPage.tsx": "Lists all notices with sorting, CSV export, printing, and secretary-only creation actions.",
  "frontend/src/pages/common/NotificationsPage.tsx": "Displays user notifications, separates unread/read items, and allows marking individual or all notifications as read.",
  "frontend/src/pages/flat/ComplaintDetailPage.tsx": "Shows full details of a specific complaint for the user's flat, including status, priority, and resolution note.",
  "frontend/src/pages/flat/ComplaintsPage.tsx": "Allows users to lodge new complaints and view existing complaints for their flat, with category, description, and priority inputs.",
  "frontend/src/pages/flat/ExpendituresPage.tsx": "Placeholder page informing users that expenditure viewing is unavailable due to missing backend support.",
  "frontend/src/pages/flat/FlatDashboardPage.tsx": "Provides a dashboard with quick-access cards for maintenance, complaints, notices, visitor requests, profile, and expenditures.",
  "frontend/src/pages/flat/MaintenancePage.tsx": "Lets users view maintenance records, select month/year, and submit payment details including UPI reference and date.",
  "frontend/src/pages/flat/ProfilePage.tsx": "Enables users to manage and update up to four mobile numbers associated with their flat.",
  "frontend/src/pages/flat/VisitorRequestsPage.tsx": "Shows visitor requests for the resident’s flat and allows approving or declining them with status updates.",
  "frontend/src/pages/guard/GuardDashboardPage.tsx": "Guard dashboard displaying pending visitor requests and quick navigation to create requests or view notices.",
  "frontend/src/pages/guard/VisitorRequestCreatePage.tsx": "Form for guards to create a visitor request and trigger a WhatsApp message to the flat owner.",
  "frontend/src/pages/guard/VisitorRequestDetailPage.tsx": "Displays full details of a specific visitor request, including status, flat info, and contact number.",
  "frontend/src/pages/guard/VisitorRequestsPage.tsx": "Lists all visitor requests for guards with filtering, status badges, and navigation to request details or creation.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen using Internet Identity with error handling and UI feedback.",
  "frontend/src/pages/secretary/ComplaintsAdminPage.tsx": "Admin view to manage and export all complaints, including stats, CSV export, and print options.",
  "frontend/src/pages/secretary/ComplaintsReportPrintPage.tsx": "Printable complaints report showing counts and a table of all complaints with statuses and priorities.",
  "frontend/src/pages/secretary/CreateNoticePage.tsx": "Form page allowing secretaries to create notices with optional expiry dates and submit them via mutation.",
  "frontend/src/pages/secretary/ExpendituresAdminPage.tsx": "Admin interface to view, add, edit, and save monthly expenditure records, with CSV export and print options.",
  "frontend/src/pages/secretary/ExpendituresReportPrintPage.tsx": "Print-friendly page that loads a specific month's expenditure data and triggers browser print once loaded.",
  "frontend/src/pages/secretary/NoticesReportPrintPage.tsx": "Print view listing all notices with details, sorted by ID, and auto-triggering print after load.",
  "frontend/src/pages/secretary/OverduePage.tsx": "Displays overdue maintenance payments by month and year, with filters and overdue status indicators.",
  "frontend/src/pages/secretary/PaymentsPage.tsx": "Management page to view all maintenance payment records for a period with CSV export and print features.",
  "frontend/src/pages/secretary/PaymentsReportPrintPage.tsx": "Print-focused view summarizing payment records for a selected period, including counts and detailed rows.",
  "frontend/src/pages/secretary/SecretaryDashboardPage.tsx": "Renders the secretary dashboard with navigation cards and shows overdue flats if applicable.",
  "frontend/src/pages/secretary/SettingsPage.tsx": "Provides UI for viewing and updating UPI ID and WhatsApp number using query/mutation hooks.",
  "frontend/src/utils/csv.ts": "Utilities for escaping fields, generating CSV content, and triggering CSV downloads.",
  "frontend/src/utils/dates.ts": "Helpers for current month/year, formatting timestamps, and generating month/year lists.",
  "frontend/src/utils/flatNumbers.ts": "Generates valid society flat numbers, validates flat numbers, and formats them for display.",
  "frontend/src/utils/hardReload.ts": "Clears caches and service workers, then forces a full page reload.",
  "frontend/src/utils/overdue.ts": "Determines whether the current date falls in the overdue period and whether to show overdue notices.",
  "frontend/src/utils/print.ts": "Opens a print-friendly view and triggers the browser print dialog.",
  "frontend/src/utils/upi.ts": "Builds a UPI deep link URL for payments.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL/session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp deep link using a cleaned number and encoded message.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins.",
  "project_state.json": "Contains project metadata, known issues, and feature requirements for improving startup error handling."
}