{
  "backend/main.mo": "Motoko canister defining core society data models (users, maintenance, expenditures, complaints, notices, visitors) and state, with role-based authorization helpers and CRUD-style APIs for flats, secretary, and guard workflows.",
  "feature_evidence.json": "Machine-readable report mapping implemented product features to frontend files, components, and test requirements with confidence levels for feature completion.",
  "frontend-file-summaries.txt": "Prewritten summary mapping that briefly describes the purpose of key frontend source files and pages in the application.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles for the Vision Galaxy Society UI.",
  "frontend/index.html": "HTML entry point that sets up the root container and loads the React application bundle.",
  "frontend/src/App.tsx": "Main React application entry configuring TanStack Router routes, authentication gating, and role-based dashboard routing for flat owners, secretary, and guard.",
  "frontend/src/components/layout/AppLayout.tsx": "Shared authenticated layout with header, role-based navigation menu, logout and password change actions, and responsive mobile navigation.",
  "frontend/src/components/layout/DashboardCard.tsx": "Reusable dashboard card component with icon, title, optional description, action button, and visual variants for status emphasis.",
  "frontend/src/hooks/useActor.ts": "Defines a React hook that creates and caches a backend actor using react-query, switching between anonymous and authenticated actors based on Internet Identity and initializing admin access if a secret token is present.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider, managing login, logout, identity persistence, and login status using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides a collection of react-query hooks for fetching and mutating backend data (profiles, maintenance, payments, notices, etc.) through the shared actor abstraction.",
  "frontend/src/index.css": "Configures Tailwind CSS base layers and defines extensive CSS variables for light and dark themes, including colors, charts, and layout styling.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering App within QueryClientProvider and InternetIdentityProvider, and imports global styles.",
  "frontend/src/pages/ChangePasswordPage.tsx": "Implements a password change page with form validation, backend mutation, success/error feedback, and forced logout after a successful password update.",
  "frontend/src/pages/common/NoticeDetailPage.tsx": "Displays detailed information for a single notice by ID, fetched from cached notices, with navigation back to the notices list.",
  "frontend/src/pages/common/NoticesPage.tsx": "Displays a list of society notices sorted by newest first, with empty-state handling and expiry badges. Allows Secretaries to navigate to a notice creation page and all users to view notice details.",
  "frontend/src/pages/flat/ComplaintDetailPage.tsx": "Shows detailed information for a single complaint belonging to the logged-in flat, including status, priority, and resolution notes. Handles missing complaints and provides navigation back to the complaints list.",
  "frontend/src/pages/flat/ComplaintsPage.tsx": "Allows flat users to lodge new complaints via a form and view their existing complaints with status badges. Integrates complaint creation, validation, and feedback via toasts.",
  "frontend/src/pages/flat/ExpendituresPage.tsx": "Enables users to select a month and year to view society expenditure details, including line items, totals, and notes. Shows an empty state when no expenditure data is available.",
  "frontend/src/pages/flat/FlatDashboardPage.tsx": "Main dashboard for flat users showing quick-access cards for maintenance, expenditures, complaints, notices, visitors, and profile. Displays an overdue maintenance alert based on the current month’s payment status.",
  "frontend/src/pages/flat/MaintenancePage.tsx": "Provides month/year selection to view maintenance status and record UPI payments for a flat. Supports UPI deep linking, payment submission, and displays paid or pending status with badges.",
  "frontend/src/pages/flat/ProfilePage.tsx": "Profile page for flat residents to view and manage up to four mobile numbers associated with their flat, including add/remove/edit and save via API mutations with validation and toast feedback.",
  "frontend/src/pages/flat/VisitorRequestsPage.tsx": "Displays all visitor requests for the logged-in flat, highlights pending requests, and allows accepting or declining requests with status badges and notifications.",
  "frontend/src/pages/guard/GuardDashboardPage.tsx": "Guard dashboard showing summary cards for visitor requests, creating new requests, and viewing notices, including a count of pending approvals and navigation actions.",
  "frontend/src/pages/guard/VisitorRequestCreatePage.tsx": "Form for guards to create a new visitor request by entering visitor details and flat number, then generating and opening a WhatsApp approval message to the flat owner.",
  "frontend/src/pages/guard/VisitorRequestDetailPage.tsx": "Detail view for a single visitor request showing visitor info, purpose, flat number, contact, and current status, with navigation back to the requests list.",
  "frontend/src/pages/guard/VisitorRequestsPage.tsx": "Lists all visitor requests for guards with sorting, status badges, WhatsApp sender info, and navigation to create new requests or view request details.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page UI and triggers Internet Identity authentication, displaying loading and error states while disabling unused credential inputs.",
  "frontend/src/pages/secretary/ComplaintsAdminPage.tsx": "Provides a complaint management UI for secretaries to filter complaints by status and flat, view details, and update complaint status with optional resolution notes.",
  "frontend/src/pages/secretary/CreateNoticePage.tsx": "Implements a form for creating and publishing notices to residents, with optional expiry date handling and navigation back to the notices list on success.",
  "frontend/src/pages/secretary/ExpendituresAdminPage.tsx": "Allows secretaries to select a month/year and record monthly expenditure items, calculate totals, add notes, and submit the data to the backend.",
  "frontend/src/pages/secretary/OverduePage.tsx": "Displays overdue maintenance payments by month and year, showing alerts based on the current date and listing flats with pending payments.",
  "frontend/src/pages/secretary/PaymentsPage.tsx": "Shows maintenance payment status for all flats for a selected period, including paid/pending counts, filters, and a detailed table view.",
  "frontend/src/pages/secretary/SecretaryDashboardPage.tsx": "Renders the main secretary dashboard with summary cards for payments, overdue flats, expenditures, complaints, notices, and settings, each linking to its management page.",
  "frontend/src/pages/secretary/SettingsPage.tsx": "Secretary-facing React page that lets admins view and update the society UPI ID and WhatsApp number using query/mutation hooks, with form inputs, loading states, and toast notifications.",
  "frontend/src/utils/dates.ts": "Date utility helpers for getting current month/year, formatting bigint timestamps into readable dates, and generating month lists and a rolling year range.",
  "frontend/src/utils/overdue.ts": "Simple helpers to determine if the current date is past the 6th of the month and whether an overdue notice should be shown based on payment status.",
  "frontend/src/utils/upi.ts": "Utility to construct a UPI payment deep link (upi://pay) using a configured UPI ID, amount, currency, and transaction note.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters from query or hash routes, persisting them in sessionStorage, retrieving/clearing them, and handling sensitive params across navigation.",
  "frontend/src/utils/whatsapp.ts": "Helper to build a WhatsApp deep link (wa.me) by cleaning the phone number and URL-encoding the message text.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, custom OKLCH-based color tokens, layout settings, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing the Vision Galaxy Society app, including schema version, overall summary, and a list of implemented features with IDs, requirements, and versions."
}