{
  "backend/main.mo": "Defines core data types and in-memory maps for maintenance, expenditures, complaints, notices, visitor requests, profiles, and notifications, along with helper validation and authorization logic.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for multiple frontend files including pages, hooks, components, and assets.",
  "frontend/.env.example": "Example environment file documenting how to set a canonical app URL for IC deployments.",
  "frontend/deploy/ic-deploy-with-retry.sh": "Deployment script for IC mainnet adding retries, cycles readiness checks, error classification, and optional canister pre-creation.",
  "frontend/deploy/ic-precreate-canisters.sh": "Script that explicitly creates backend and frontend canisters on IC mainnet to avoid reservation failures before deployment.",
  "frontend/deploy/README.md": "Explains prerequisites and steps for deploying the project to the Internet Computer mainnet.",
  "frontend/docs/deployment-troubleshooting.md": "Troubleshooting guide describing common IC deployment issues and readiness checks with verification commands.",
  "frontend/index.css": "Defines Tailwind layers and CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/index.html": "HTML entry page setting metadata, a startup loading UI, redirect logic for ic0.app, and error fallback handling before loading the React app.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, theme colors, start URL, and app icons.",
  "frontend/public/sw.js": "Service worker implementing install, fetch, and activate handlers with caching logic for navigation, scripts, styles, and assets.",
  "frontend/src/App.tsx": "Main app router and authentication flow managing identity, profile loading, error handling, and conditional rendering of dashboards and pages.",
  "frontend/src/components/FatalStartupErrorScreen.tsx": "UI component that displays a fatal startup error with reload and hard-reload actions.",
  "frontend/src/components/FlatNumberPicker.tsx": "Flat number picker allowing typed input, arrow navigation, and popover selection of valid flat numbers.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, header, PWA install handling, and logout logic.",
  "frontend/src/components/layout/DashboardCard.tsx": "Reusable dashboard card supporting icons, actions, variants, and custom content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for creating a user profile with validation and backend submission.",
  "frontend/src/components/QueryStateCard.tsx": "Card wrapper that displays loading, error, empty, or content states for queries.",
  "frontend/src/components/StartupErrorBoundary.tsx": "Error boundary capturing startup errors and showing a fatal error screen if triggered.",
  "frontend/src/components/StartupErrorScreen.tsx": "UI screen offering retry, logout, and hard reload options when startup fails.",
  "frontend/src/contexts/ActorContext.tsx": "Context provider managing actor initialization, timeout handling, and refetch logic.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor, reacting to identity changes and invalidating queries.",
  "frontend/src/hooks/useActorContext.ts": "Hook to access the ActorContext and enforce provider usage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/usePwaInstall.ts": "Implements a hook that detects PWA install availability and exposes a prompt function to trigger installation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, maintenance records, payments, and related actions.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, theme variables, dark mode values, responsive tweaks, and print styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with InternetIdentityProvider and React Query client providers.",
  "frontend/src/pages/ChangePasswordPage.tsx": "Renders a form for changing the user’s password and handles validation, mutation, logout, and navigation after success.",
  "frontend/src/pages/common/NoticeDetailPage.tsx": "Shows detailed information for a single notice, including title, message, expiry, and navigation back to the notice list.",
  "frontend/src/pages/common/NoticesPage.tsx": "Displays all notices, allows secretaries to create, export, and print notices, and navigates to notice details.",
  "frontend/src/pages/common/NotificationsPage.tsx": "Shows user notifications with unread/read sections and supports marking one or all notifications as read.",
  "frontend/src/pages/flat/ComplaintDetailPage.tsx": "Shows detailed information for a specific complaint including status, description, priority, and resolution note.",
  "frontend/src/pages/flat/ComplaintsPage.tsx": "Lets users lodge new complaints and view a list of their existing complaints with status badges.",
  "frontend/src/pages/flat/ExpendituresPage.tsx": "Placeholder page explaining that expenditure tracking is unavailable due to missing backend support.",
  "frontend/src/pages/flat/FlatDashboardPage.tsx": "Home dashboard for flat users with quick-access cards for maintenance, expenditures, complaints, notices, visitors, and profile.",
  "frontend/src/pages/flat/MaintenancePage.tsx": "Allows users to view maintenance status, pay via UPI, and record payment details for selected months and years.",
  "frontend/src/pages/flat/ProfilePage.tsx": "Manages viewing and editing up to four mobile numbers for the logged‑in user's flat, including add/remove UI and mutation to save changes.",
  "frontend/src/pages/flat/VisitorRequestsPage.tsx": "Displays visitor requests for the user's flat and allows approving or declining them with flat‑number validation.",
  "frontend/src/pages/guard/GuardDashboardPage.tsx": "Guard dashboard showing counts and navigation cards for viewing requests, creating requests, and checking notices.",
  "frontend/src/pages/guard/VisitorRequestCreatePage.tsx": "Form for guards to create a visitor request, fetch flat mobile numbers, and open a WhatsApp deep link after creation.",
  "frontend/src/pages/guard/VisitorRequestDetailPage.tsx": "Shows detailed information for a single visitor request, including status, flat, purpose, and contact number.",
  "frontend/src/pages/guard/VisitorRequestsPage.tsx": "Lists all visitor requests with sorting, status badges, optional WhatsApp sender info, and navigation to detail pages.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login UI using Internet Identity, handling logo loading, errors, and login attempts.",
  "frontend/src/pages/secretary/ComplaintsAdminPage.tsx": "Displays all complaints with stats, CSV export, and print options using query data and a table layout.",
  "frontend/src/pages/secretary/ComplaintsReportPrintPage.tsx": "Generates a print‑friendly complaints report with summary counts and a detailed table.",
  "frontend/src/pages/secretary/components/SettingsSkeleton.tsx": "Provides a skeleton placeholder UI for the settings page while data loads.",
  "frontend/src/pages/secretary/CreateNoticePage.tsx": "Form page for creating a new notice with optional expiry and submission via mutation.",
  "frontend/src/pages/secretary/ExpendituresAdminPage.tsx": "Manages monthly expenditures, allowing entry, editing, CSV export, printing, and saving via mutation.",
  "frontend/src/pages/secretary/ExpendituresReportPrintPage.tsx": "Print‑optimized expenditure report showing all items, total, and notes for a selected month and year.",
  "frontend/src/pages/secretary/NoticesReportPrintPage.tsx": "Print view listing all notices with IDs, messages, and expiry dates in sorted order.",
  "frontend/src/pages/secretary/OverduePage.tsx": "Shows overdue flats for selected month/year and allows sending notifications to all overdue units.",
  "frontend/src/pages/secretary/PaymentsPage.tsx": "Renders the secretary payments management UI, fetching payment status for all flats and enabling CSV export and print actions.",
  "frontend/src/pages/secretary/PaymentsReportPrintPage.tsx": "Loads payment status data for a given month/year and auto-triggers a printable report view.",
  "frontend/src/pages/secretary/SecretaryDashboardPage.tsx": "Displays the secretary dashboard with navigation cards and overdue-flats status loading.",
  "frontend/src/pages/secretary/SettingsPage.tsx": "Manages secretary configuration settings, including logo upload, validation, and saving updates.",
  "frontend/src/utils/canonicalUrl.ts": "Utility functions for handling canonical URLs, origins, base paths, and URL joining.",
  "frontend/src/utils/csv.ts": "Provides CSV generation and download utilities with proper field escaping.",
  "frontend/src/utils/dates.ts": "Date helpers for current month/year, timestamp formatting, and month/year lists.",
  "frontend/src/utils/flatNumbers.ts": "Generates, validates, formats, and navigates through valid flat numbers in defined 1–5 floor ranges.",
  "frontend/src/utils/hardReload.ts": "Clears caches and service workers, then forces a full page reload.",
  "frontend/src/utils/overdue.ts": "Determines if the current date is overdue and whether to show an overdue notice.",
  "frontend/src/utils/print.ts": "Opens a print view in a new tab and triggers the browser print dialog.",
  "frontend/src/utils/sanitizeError.ts": "Sanitizes error objects into safe, user-friendly messages while removing sensitive data.",
  "frontend/src/utils/settingsValidation.ts": "Validates and normalizes secretary settings fields like maintenance amount, UPI ID, and guard number.",
  "frontend/src/utils/upi.ts": "Builds a UPI payment deep link with ID, amount, and note.",
  "frontend/src/utils/urlParams.ts": "Handles URL and session parameter parsing, persistence, and cleanup for routing.",
  "frontend/src/utils/whatsapp.ts": "Creates a WhatsApp deep link using a cleaned phone number and encoded message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, animations, and plugins.",
  "frontend/vite-env.d.ts": "Type definitions for Vite environment variables.",
  "project_state.json": "Project metadata describing schema, features, and deployment-related requirements."
}