{
  "backend/main.mo": "Motoko canister implementing the core society management backend with types and state for maintenance records, expenditures, complaints, notices, visitor requests, users, and notifications, plus role-based access control. The file notes no changes are required for mainnet deployment retry/fallback logic.",
  "feature_evidence.json": "Machine-readable report documenting features related to IC mainnet deployment retry tooling and pre-deployment cycles checks, including associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Aggregated summary file describing the purpose of major frontend source files, pages, hooks, PWA assets, and documentation for quick build and feature overview.",
  "frontend/deploy/ic-deploy-with-retry.sh": "Bash script that wraps `dfx deploy --network ic` with configurable retry attempts, delay, detailed logging, and a pre-deployment cycles/wallet readiness check with clear guidance on failures.",
  "frontend/deploy/ic-precreate-canisters.sh": "Helper Bash script that pre-creates backend and frontend canisters on IC mainnet to avoid CaLM reservation failures before running a standard deployment.",
  "frontend/deploy/README.md": "Documentation explaining the IC mainnet deployment helper tools, focusing on retry logic, cycles/wallet readiness checks, CaLM failure handling, and how to use the deployment scripts.",
  "frontend/docs/deployment-troubleshooting.md": "Troubleshooting guide for IC mainnet deployment covering prerequisites, common errors, and detailed explanation of the automated cycles/wallet readiness checks and manual verification steps.",
  "frontend/index.css": "Global Tailwind CSS configuration defining light and dark themes using OKLCH color variables, shared design tokens, and base styles for the entire frontend.",
  "frontend/index.html": "HTML entry point for the frontend app with PWA-related meta tags, icons, manifest link, and script loading the React application.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, display mode, orientation, and categories for installable web app behavior.",
  "frontend/public/sw.js": "Service worker implementing basic offline support by caching core assets, serving cached responses when available, and cleaning up old caches on activation.",
  "frontend/src/App.tsx": "Defines the root application component, handling authentication, profile loading/setup flow, and conditional rendering before showing the main AppLayout with TanStack Router outlets.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with header, role-based navigation, notifications, PWA install, and logout logic, wrapping all authenticated pages.",
  "frontend/src/components/layout/DashboardCard.tsx": "Reusable dashboard card component with icon, title, optional description, actions, and visual variants for status emphasis.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects initial user profile details (name, role, flat number) and saves them via a mutation before allowing app access.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook managing Internet Identity authentication, login/logout flow, identity persistence, and detailed login status flags.",
  "frontend/src/hooks/usePwaInstall.ts": "Hook that listens for the PWA install prompt event and exposes install availability and a method to trigger installation.",
  "frontend/src/hooks/useQueries.ts": "Defines a collection of React Query hooks for fetching and mutating backend data via an actor, including user profiles, maintenance records, payments, notices, and settings, with cache invalidation on mutations.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens for light/dark themes, base styles, responsive typography, mobile tap targets, and print-specific styling.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/ChangePasswordPage.tsx": "Implements a change-password form that validates input, calls the change password mutation, shows success/error feedback, and logs the user out after success.",
  "frontend/src/pages/common/NoticeDetailPage.tsx": "Displays the details of a single notice selected by ID, with navigation back to the notices list and optional expiry information.",
  "frontend/src/pages/common/NoticesPage.tsx": "Lists all notices with sorting, navigation to details, and secretary-only actions for CSV export, printing, and creating new notices.",
  "frontend/src/pages/common/NotificationsPage.tsx": "Displays caller notifications split into unread and read sections, with relative timestamps. Supports marking individual notifications or all notifications as read using mutations and shows loading/empty states.",
  "frontend/src/pages/flat/ComplaintDetailPage.tsx": "Shows detailed information for a single complaint belonging to the caller’s flat, including status, priority, and resolution note. Fetches complaints by flat and handles missing complaint cases.",
  "frontend/src/pages/flat/ComplaintsPage.tsx": "Allows flat residents to lodge new complaints via a form and view a list of their existing complaints. Integrates complaint creation, status badges, and navigation to complaint details.",
  "frontend/src/pages/flat/ExpendituresPage.tsx": "Placeholder page for viewing monthly society expenditures. Clearly indicates that the feature is unavailable due to missing backend support.",
  "frontend/src/pages/flat/FlatDashboardPage.tsx": "Main dashboard for flat residents showing quick-access cards for maintenance, complaints, notices, visitors, profile, and expenditures. Highlights overdue maintenance payments with an alert.",
  "frontend/src/pages/flat/MaintenancePage.tsx": "Enables residents to view maintenance payment status by month/year and record a new payment with UPI reference details. Generates UPI payment links and displays paid or pending status badges.",
  "frontend/src/pages/flat/ProfilePage.tsx": "Allows residents to manage up to four mobile numbers associated with their flat for visitor approvals. Fetches, edits, validates, and saves mobile numbers via backend mutations.",
  "frontend/src/pages/flat/VisitorRequestsPage.tsx": "Flat resident page that lists visitor entry requests for the user’s flat, showing status and allowing pending requests to be approved or declined with API mutations and toast feedback.",
  "frontend/src/pages/guard/GuardDashboardPage.tsx": "Guard dashboard overview showing counts of pending visitor requests and navigation cards to view requests, create a new request, or view notices.",
  "frontend/src/pages/guard/VisitorRequestCreatePage.tsx": "Form page for guards to create a new visitor request, select flat and contact number, submit it via API, and open a prefilled WhatsApp message for approval.",
  "frontend/src/pages/guard/VisitorRequestDetailPage.tsx": "Detail view for a single visitor request, displaying visitor info, flat, contact number, and current status with navigation back to the requests list.",
  "frontend/src/pages/guard/VisitorRequestsPage.tsx": "List page for guards showing all visitor requests sorted by newest, with status badges, WhatsApp sender info, and navigation to create or view request details.",
  "frontend/src/pages/LoginPage.tsx": "Login screen that authenticates users via Internet Identity, handles login errors, and presents a branded UI for society access.",
  "frontend/src/pages/secretary/ComplaintsAdminPage.tsx": "Secretary admin page for managing complaints, showing summary counts, a table of all complaints, and actions to export data as CSV or open a print view.",
  "frontend/src/pages/secretary/ComplaintsReportPrintPage.tsx": "Printable report page that loads all complaints, displays summary statistics and a table, and automatically triggers the browser print dialog.",
  "frontend/src/pages/secretary/CreateNoticePage.tsx": "Form page for secretaries to create and submit a new notice with title, message, and optional expiry date, using a mutation hook and showing toast feedback.",
  "frontend/src/pages/secretary/ExpendituresAdminPage.tsx": "Admin interface to record, edit, and view monthly expenditures, including itemized entries, notes, CSV export, and print functionality.",
  "frontend/src/pages/secretary/ExpendituresReportPrintPage.tsx": "Print-optimized page that fetches and displays a monthly expenditure report with totals and notes, automatically triggering the browser print dialog.",
  "frontend/src/pages/secretary/NoticesReportPrintPage.tsx": "Print-only report page that lists all notices in descending order with title, message, and expiry date, and auto-triggers printing once loaded.",
  "frontend/src/pages/secretary/OverduePage.tsx": "Page to view flats with overdue maintenance payments for a selected month and year, including alerts based on the current overdue period.",
  "frontend/src/pages/secretary/PaymentsPage.tsx": "Management page for reviewing monthly maintenance payment records, with filters by month/year and options to export CSV or print reports.",
  "frontend/src/pages/secretary/PaymentsReportPrintPage.tsx": "Print-friendly payment report showing paid and unpaid flats for a selected period, including summary counts and automatic print triggering.",
  "frontend/src/pages/secretary/SecretaryDashboardPage.tsx": "Secretary dashboard page rendering navigation cards for payments, overdue flats, expenditures, complaints, notices, and settings, with conditional overdue status based on date and fetched data.",
  "frontend/src/pages/secretary/SettingsPage.tsx": "Settings page allowing the secretary to view and update the society UPI ID and WhatsApp number using query hooks, form inputs, and toast notifications.",
  "frontend/src/utils/csv.ts": "Utility functions to generate CSV strings from data, properly escape fields, and trigger client-side CSV file downloads.",
  "frontend/src/utils/dates.ts": "Date utility helpers for getting the current month/year, formatting bigint timestamps into readable dates, and generating month and year ranges.",
  "frontend/src/utils/overdue.ts": "Helpers to determine whether the current date is in the overdue period and whether an overdue notice should be shown based on payment status.",
  "frontend/src/utils/print.ts": "Simple utilities to open a print-friendly route in a new tab and trigger the browser print dialog.",
  "frontend/src/utils/upi.ts": "Builds a UPI payment deep link URL with predefined payee name, amount, currency, and note.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters (including hash-based routing), persisting them in sessionStorage, and managing stored parameters across navigation.",
  "frontend/src/utils/whatsapp.ts": "Generates a WhatsApp deep link URL by normalizing a mobile number and encoding a preset message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens via CSS variables, animations, container settings, and registered plugins.",
  "project_state.json": "Metadata file describing the project’s current state, versioning, and a detailed list of implemented features for the Vision Galaxy Society ICP application."
}