{
  "backend/main.mo": "Defines canister state, entity types, maps, counters, and helper authorization/validation functions for maintenance, expenditures, complaints, notices, visitors, users, and notifications.",
  "feature_evidence.json": "JSON report mapping features to related files, components, tests, and confidence levels for deployment‑retry and troubleshooting improvements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files including pages, hooks, components, and configuration assets.",
  "frontend/.env.example": "Example environment file documenting optional canonical app URL configuration for IC deployment and PWA behavior.",
  "frontend/deploy/ic-deploy-with-retry.sh": "Shell script wrapping dfx deploy with retries, cycles/identity checks, optional canister pre‑creation, and troubleshooting guidance.",
  "frontend/deploy/ic-precreate-canisters.sh": "Script that pre‑creates backend and frontend canisters on IC mainnet to avoid reservation errors before deployment.",
  "frontend/deploy/README.md": "Guide explaining prerequisites and step‑by‑step instructions for deploying the app to the Internet Computer mainnet.",
  "frontend/docs/deployment-troubleshooting.md": "Troubleshooting guide covering common IC deployment failures, readiness checks, and manual verification commands.",
  "frontend/index.css": "Tailwind‑based global styles defining OKLCH color variables, light/dark theme values, and base layout rules.",
  "frontend/index.html": "Main HTML entry file with startup loader, redirect logic for ic0.app URLs, and fallback error handling.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, icons, and startup configuration.",
  "frontend/public/sw.js": "Service worker managing caching strategy, offline behavior, and cache versioning for app assets.",
  "frontend/src/App.tsx": "Main React app bootstrap handling authentication, profile loading, role-based routing, and global layout.",
  "frontend/src/components/FatalStartupErrorScreen.tsx": "UI component that displays a fatal startup error with reload and hard-reload options.",
  "frontend/src/components/FlatNumberPicker.tsx": "Interactive flat number input with validation, increment/decrement controls, and selectable popover list.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, header logic, PWA install handling, and logout flow.",
  "frontend/src/components/layout/DashboardCard.tsx": "Dashboard card component with icon, title, optional description, variant styling, and optional action button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for creating a user profile including name, role selection, and optional flat number.",
  "frontend/src/components/QueryStateCard.tsx": "Reusable card component that renders loading, error, empty, or content states with optional retry and titles.",
  "frontend/src/components/StartupErrorBoundary.tsx": "Error boundary that catches early startup errors and displays a fatal error screen.",
  "frontend/src/components/StartupErrorScreen.tsx": "Full‑screen error UI offering retry, logout, and hard reload actions with optional error details.",
  "frontend/src/contexts/ActorContext.tsx": "Provides actor and fetching state from useActor via React context.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages backend actors based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useActorContext.ts": "Utility hook to access the ActorContext and enforce provider usage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication hook and provider for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/usePwaInstall.ts": "Hook that captures the beforeinstallprompt event and exposes installability and install prompt logic.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple React Query hooks to fetch and mutate user profiles, maintenance records, notices, payments, and related actor-driven backend data.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode settings, mobile tweaks, and print-specific CSS rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ChangePasswordPage.tsx": "Implements a password change form with validation, mutation handling, and logout flow after successful update.",
  "frontend/src/pages/common/NoticeDetailPage.tsx": "Displays detailed information for a single notice, including title, message, and expiry date.",
  "frontend/src/pages/common/NoticesPage.tsx": "Lists all notices with sorting, secretary-only CSV/print actions, and navigation to details or creation.",
  "frontend/src/pages/common/NotificationsPage.tsx": "Displays user notifications, allows marking individual or all notifications as read, and organizes them into unread and read sections.",
  "frontend/src/pages/flat/ComplaintDetailPage.tsx": "Shows detailed information for a specific complaint, including status, description, priority, and resolution note.",
  "frontend/src/pages/flat/ComplaintsPage.tsx": "Lets users lodge new complaints and view a list of their existing complaints with status indicators.",
  "frontend/src/pages/flat/ExpendituresPage.tsx": "Placeholder page explaining that expenditure tracking is not yet supported by the backend.",
  "frontend/src/pages/flat/FlatDashboardPage.tsx": "Provides a dashboard with quick-access cards for maintenance, expenditures, complaints, notices, visitor requests, and profile management.",
  "frontend/src/pages/flat/MaintenancePage.tsx": "Allows users to view maintenance dues, record payments via UPI, and check payment status for selected months and years.",
  "frontend/src/pages/flat/ProfilePage.tsx": "Enables users to manage up to four mobile numbers associated with their flat for visitor approval notifications.",
  "frontend/src/pages/flat/VisitorRequestsPage.tsx": "Displays visitor requests for a resident’s flat, allowing approval or decline with flat-number validation.",
  "frontend/src/pages/guard/GuardDashboardPage.tsx": "Guard dashboard showing pending visitor requests and navigation to request creation and notices.",
  "frontend/src/pages/guard/VisitorRequestCreatePage.tsx": "Form for guards to create visitor requests, fetch flat owner contacts, and open WhatsApp with a prefilled message.",
  "frontend/src/pages/guard/VisitorRequestDetailPage.tsx": "Shows full details of a specific visitor request with status and flat information.",
  "frontend/src/pages/guard/VisitorRequestsPage.tsx": "Lists all visitor requests for guards with sorting, status badges, and navigation to request details or creation.",
  "frontend/src/pages/LoginPage.tsx": "Renders the Internet Identity login UI with error handling and optional custom logo loading.",
  "frontend/src/pages/secretary/ComplaintsAdminPage.tsx": "Admin page for viewing, exporting, and printing all resident complaints with status counts.",
  "frontend/src/pages/secretary/ComplaintsReportPrintPage.tsx": "Print-optimized page rendering all complaints in a table and auto-triggering print when loaded.",
  "frontend/src/pages/secretary/components/SettingsSkeleton.tsx": "Provides skeleton placeholders for the settings page while data loads, including logo and configuration sections.",
  "frontend/src/pages/secretary/CreateNoticePage.tsx": "Form page for creating a notice with optional expiry date and submitting via createNotice mutation.",
  "frontend/src/pages/secretary/ExpendituresAdminPage.tsx": "Admin page to view, add, edit, and save monthly expenditure items, with CSV export and print options.",
  "frontend/src/pages/secretary/ExpendituresReportPrintPage.tsx": "Print-friendly view of a month's expenditure report, auto-triggering print after data loads.",
  "frontend/src/pages/secretary/NoticesReportPrintPage.tsx": "Print page listing all notices with ID, title, message, and expiry, sorted by newest first.",
  "frontend/src/pages/secretary/OverduePage.tsx": "Displays overdue flats for a selected month and year with period selection and reminder rules.",
  "frontend/src/pages/secretary/PaymentsPage.tsx": "Management page showing payment status for all flats with CSV export and print options.",
  "frontend/src/pages/secretary/PaymentsReportPrintPage.tsx": "Print-friendly report of flat payment statuses for a selected period, including counts and details.",
  "frontend/src/pages/secretary/SecretaryDashboardPage.tsx": "Renders the secretary dashboard with navigation cards for payments, overdue flats, expenditures, complaints, notices, and settings.",
  "frontend/src/pages/secretary/SettingsPage.tsx": "Implements the secretary settings UI with logo upload, form state, validation, and update logic using queries and mutations.",
  "frontend/src/utils/canonicalUrl.ts": "Utility functions for handling canonical URLs, redirects, base paths, and URL construction.",
  "frontend/src/utils/csv.ts": "CSV utilities for escaping fields, generating CSV content, and triggering downloads.",
  "frontend/src/utils/dates.ts": "Date helpers for current month/year, formatting timestamps, listing months, and generating a year range.",
  "frontend/src/utils/flatNumbers.ts": "Manages valid society flat numbers with generation, validation, formatting, and navigation helpers.",
  "frontend/src/utils/hardReload.ts": "Performs a hard reload by clearing caches, unregistering service workers, and reloading the page.",
  "frontend/src/utils/overdue.ts": "Determines whether the current date is in the overdue period and whether to show overdue notices.",
  "frontend/src/utils/print.ts": "Provides helpers to open a print view and trigger the browser print dialog.",
  "frontend/src/utils/sanitizeError.ts": "Cleans and formats error messages by removing sensitive data and producing user-safe output.",
  "frontend/src/utils/settingsValidation.ts": "Validation and normalization helpers for secretary settings fields, including maintenance amount, UPI ID, and guard number.",
  "frontend/src/utils/upi.ts": "Generates a UPI payment deep link using an ID, amount, and note.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp deep link by cleaning the phone number and encoding a message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "frontend/vite-env.d.ts": "Type definitions extending Vite environment variables.",
  "project_state.json": "Project metadata describing state, issues, and existing feature requirements."
}