{
  "backend/main.mo": "Defines core data types and state maps for maintenance, expenditures, complaints, notices, visitor requests, users, and notifications, with authorization and helper functions.",
  "feature_evidence.json": "Feature evidence report linking features to impacted files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose, behavior, and key implementation details.",
  "frontend/deploy/ic-deploy-with-retry.sh": "Shell script wrapping dfx deploy with retry logic, cycles/wallet readiness checks, and detailed error messaging.",
  "frontend/deploy/ic-precreate-canisters.sh": "Script that pre-creates backend and frontend canisters on IC mainnet to avoid CaLM reservation issues.",
  "frontend/deploy/README.md": "Documentation describing IC mainnet deployment helper tools and their capabilities such as retries and cycles checks.",
  "frontend/docs/deployment-troubleshooting.md": "Troubleshooting guide for IC mainnet deployment covering prerequisites, cycles checks, and common failure modes.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark OKLCH themes and base styling variables.",
  "frontend/index.html": "HTML entry point defining PWA metadata and a styled startup fallback screen used before React mounts.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring app name, icons, theme, and display settings for Vision Galaxy.",
  "frontend/public/sw.js": "Service worker handling caching, fetch routing, and offline fallback behavior for app assets and navigation.",
  "frontend/src/App.tsx": "Root React app managing authentication, profile loading, routing, and startup state handling.",
  "frontend/src/components/FatalStartupErrorScreen.tsx": "Component showing a fatal startup error UI with reload and hard-reload options.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component handling navigation, user profile loading, notifications, PWA install prompts, and logout functionality.",
  "frontend/src/components/layout/DashboardCard.tsx": "Reusable card component for dashboard sections with icon, title, optional description, actions, and variants.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first‑time users to enter name, role, and optional flat number and save their profile.",
  "frontend/src/components/StartupErrorBoundary.tsx": "Error boundary that captures early startup errors and displays the fatal startup screen.",
  "frontend/src/components/StartupErrorScreen.tsx": "Non-fatal startup error screen offering retry, logout, and hard reload options.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login state, and persistence via Dfinity AuthClient.",
  "frontend/src/hooks/usePwaInstall.ts": "Hook that listens for the PWA install prompt event and exposes installability state and an install trigger.",
  "frontend/src/hooks/useQueries.ts": "Collection of data-fetching and mutation hooks that call backend actor methods for user profiles, maintenance, payments, notifications, and related data.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables, dark mode styles, responsive tweaks, and print-specific rules.",
  "frontend/src/main.tsx": "Application entry point setting up React, QueryClient, InternetIdentityProvider, and global styles before rendering App.",
  "frontend/src/pages/ChangePasswordPage.tsx": "Provides a form for users to change their password with validation and triggers logout after success.",
  "frontend/src/pages/common/NoticeDetailPage.tsx": "Displays full details of a selected notice, including title, message, and optional expiry date.",
  "frontend/src/pages/common/NoticesPage.tsx": "Shows a sortable list of notices with export, print, and creation options for secretaries.",
  "frontend/src/pages/common/NotificationsPage.tsx": "Lists unread and read notifications with actions to mark individual or all as read.",
  "frontend/src/pages/flat/ComplaintDetailPage.tsx": "Shows detailed information for a specific complaint, including status, priority, and resolution notes.",
  "frontend/src/pages/flat/ComplaintsPage.tsx": "Form and list view for lodging new complaints and displaying existing complaints for a flat.",
  "frontend/src/pages/flat/ExpendituresPage.tsx": "Placeholder page informing users that expenditure tracking is not yet supported by the backend.",
  "frontend/src/pages/flat/FlatDashboardPage.tsx": "Dashboard showing maintenance status, complaints, notices, expenditures, visitor requests, and profile navigation for a flat.",
  "frontend/src/pages/flat/MaintenancePage.tsx": "Interface for viewing monthly maintenance records, paying via UPI, and submitting payment details.",
  "frontend/src/pages/flat/ProfilePage.tsx": "Page to view, add, edit, and save up to four mobile numbers associated with a flat.",
  "frontend/src/pages/flat/VisitorRequestsPage.tsx": "Allows residents to review, approve, or decline visitor requests with validation of flat numbers.",
  "frontend/src/pages/guard/GuardDashboardPage.tsx": "Dashboard for security guards showing pending visitor requests, request creation, and notices.",
  "frontend/src/pages/guard/VisitorRequestCreatePage.tsx": "Form page allowing guards to create a visitor request, submit it via mutation, and open a WhatsApp deep link for approval.",
  "frontend/src/pages/guard/VisitorRequestDetailPage.tsx": "Displays details of a specific visitor request including status, purpose, flat info, and contact number.",
  "frontend/src/pages/guard/VisitorRequestsPage.tsx": "Lists all visitor requests with status badges, navigation to details, and an option to create new requests.",
  "frontend/src/pages/LoginPage.tsx": "Renders an Internet Identity login screen with error handling and optional custom logo loading.",
  "frontend/src/pages/secretary/ComplaintsAdminPage.tsx": "Admin dashboard for viewing, exporting, printing, and summarizing all resident complaints.",
  "frontend/src/pages/secretary/ComplaintsReportPrintPage.tsx": "Print-optimized page showing a full complaints report with counts and a table of all complaints.",
  "frontend/src/pages/secretary/components/SettingsSkeleton.tsx": "Skeleton UI component showing loading placeholders for the secretary settings page.",
  "frontend/src/pages/secretary/CreateNoticePage.tsx": "Form for secretaries to create a notice with optional expiry and submit it to the system.",
  "frontend/src/pages/secretary/ExpendituresAdminPage.tsx": "Provides UI to view, edit, and save monthly expenditure records, including CSV export and print options.",
  "frontend/src/pages/secretary/ExpendituresReportPrintPage.tsx": "Renders a print‑friendly expenditure report for a given month and year and auto‑triggers printing.",
  "frontend/src/pages/secretary/NoticesReportPrintPage.tsx": "Displays a print‑ready table of all notices sorted by ID and triggers printing once loaded.",
  "frontend/src/pages/secretary/OverduePage.tsx": "Shows overdue flats for a selected period with month/year filters and overdue reminders.",
  "frontend/src/pages/secretary/PaymentsPage.tsx": "Shows maintenance payment status for all flats with CSV export and print options for a selected period.",
  "frontend/src/pages/secretary/PaymentsReportPrintPage.tsx": "Generates a print‑friendly maintenance payment report including counts and detailed statuses.",
  "frontend/src/pages/secretary/SecretaryDashboardPage.tsx": "Dashboard linking to payments, overdue, expenditures, complaints, notices, and settings with quick stats.",
  "frontend/src/pages/secretary/SettingsPage.tsx": "React page for managing secretary settings including logo upload, maintenance amount, UPI ID, and guard mobile number with validation and update logic.",
  "frontend/src/utils/csv.ts": "Utility functions to generate CSV from data and trigger CSV file downloads.",
  "frontend/src/utils/dates.ts": "Date helpers for formatting timestamps and retrieving month and year info.",
  "frontend/src/utils/flatNumbers.ts": "Utilities to generate, validate, and format society flat numbers within defined ranges.",
  "frontend/src/utils/hardReload.ts": "Clears caches and service workers before forcing a hard page reload.",
  "frontend/src/utils/overdue.ts": "Helpers to determine overdue periods and whether to show overdue notices.",
  "frontend/src/utils/print.ts": "Utilities to open a print view and trigger the browser print dialog.",
  "frontend/src/utils/settingsValidation.ts": "Validation logic for secretary settings fields including maintenance amount, UPI ID, and guard contact.",
  "frontend/src/utils/upi.ts": "Builds a UPI deep link string for payment requests.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/src/utils/whatsapp.ts": "Builds a WhatsApp deep link for sending a prefilled message to a phone number.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, and the main issue of a blank Draft/Preview screen. Contains requirements for HTML fallback UI, startup diagnostics, and service worker cache invalidation."
}