{
  "kind": "build_request",
  "title": "Fix app startup hang when user profile query fails (show error + recovery options)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the app startup/auth gate to handle failures when loading the caller user profile so the UI never gets stuck on an indefinite loading screen. Specifically, when `useGetCallerUserProfile()` returns an error (e.g., backend unreachable / actor not available), render a clear error state with recovery actions instead of showing the “Setting up your profile...” spinner.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "It's not opening"
        ]
      },
      "acceptanceCriteria": [
        "If `getCallerUserProfile` fails (network error, canister error, or actor not available), the app shows an error screen instead of an infinite loading state.",
        "The error screen contains user-facing text in English that indicates the app failed to load required data and suggests trying again.",
        "The error screen provides a “Retry” action that re-attempts loading the profile (via React Query refetch/invalidation).",
        "The error screen provides a “Logout” action to allow the user to re-authenticate if the identity/session is in a bad state.",
        "When the backend becomes reachable again, using “Retry” successfully proceeds into the app without requiring a full page reload."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a safe client-side recovery path for cases where the PWA/service worker cache or a bad client state prevents the app from opening, by providing a “Hard reload” action in the startup error UI that clears relevant browser caches (including service worker caches if present) and reloads the page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "It's not opening"
        ]
      },
      "acceptanceCriteria": [
        "The startup error UI includes a “Hard reload” action.",
        "“Hard reload” clears Cache Storage entries created by the app (best-effort) and then reloads the page.",
        "If a service worker is registered, the hard reload flow attempts to unregister it (best-effort) before reloading.",
        "The hard reload flow does not throw uncaught exceptions if any operation fails (e.g., permissions, unsupported APIs)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (read-only shadcn components).",
    "Do not edit immutable hook files: `frontend/src/hooks/useInternetIdentity.ts(x)` and `frontend/src/hooks/useActor.ts`. Implement startup error handling in app-level components instead."
  ],
  "nonGoals": [
    "Adding new features unrelated to app startup reliability.",
    "Changing backend schemas or business logic for flat numbering as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}