{
  "kind": "build_request",
  "title": "Improve deployment retry and diagnostics for failed application creation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When an IC mainnet deploy/build fails with a generic failure (e.g., the platform reports \"Application creation unsuccessful\"), provide a clear, actionable troubleshooting path by improving deploy output and documentation so a developer can immediately identify the likely cause (identity/wallet/cycles/CaLM reservation/dfx issues) and the next command(s) to run.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "❌ Application creation unsuccessful",
          "That build didn’t go through — want me to try again?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Deployment helper output includes a dedicated section for generic failures that: (1) points to the saved log file location, (2) prints the last relevant error lines, and (3) links to the local troubleshooting doc path.",
        "Troubleshooting documentation explicitly includes the failure text \"Application creation unsuccessful\" as a symptom and lists concrete checks/commands (dfx version, identity, wallet, cycles balance, pre-create canisters, retry deploy).",
        "No user-facing documentation text uses non-English language."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enhance the existing deployment retry workflow to reduce repeated failures by automatically recommending and/or invoking the canister pre-creation step when the deployment output indicates canister reservation or creation problems (including, but not limited to, CaLM reservation failures).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "❌ Application creation unsuccessful",
          "That build didn’t go through — want me to try again?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "If deploy output matches a canister reservation/creation failure pattern, the deploy helper prints a prominent instruction to run `./frontend/deploy/ic-precreate-canisters.sh` before the next retry (or performs that step when a non-interactive safe mode flag is enabled, if implemented).",
        "Retry attempts continue to save per-attempt logs to a deterministic location and print that location at the end of the script execution.",
        "The deployment helper continues to support the existing CaLM-specific detection behavior and does not regress successful deploy output (frontend URL/canister ID)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add a migration if backend stable state changes (not expected for deployment-script/doc changes)."
  ],
  "nonGoals": [
    "Fixing in-app performance/unresponsiveness, payment totals showing as zero, or the Secretary Settings \"Save Configuration\" button behavior (tracked separately in existing feature requirements REQ-1 to REQ-4 in project_state.json).",
    "Adding any third-party CI/CD, cloud deployment, or external infrastructure integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}