{
  "kind": "build_request",
  "title": "Fix secretary settings not saving due to incorrect 'No changes to save' dirty-check",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the secretary Settings page so that editing any of the configuration fields (Monthly Maintenance Amount, Society UPI ID, Guard Mobile Number) correctly marks the form as changed and allows saving, instead of incorrectly showing/behaving like there is “No changes to save”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The bug is still there where the secretary's profile settings is not being saved saying nothing to change"
        ]
      },
      "acceptanceCriteria": [
        "On `frontend/src/pages/secretary/SettingsPage.tsx`, after changing any of the three configuration inputs from their currently loaded values, the Save Configuration button becomes enabled (unless validation errors exist).",
        "The “No changes to save” helper text only appears when the currently displayed input values are effectively identical to the last loaded/saved values (after normalization such as trimming text fields and comparing the maintenance amount numerically).",
        "If the user types leading/trailing spaces into UPI ID or Guard Mobile Number, the dirty-check uses trimmed values so that saving behaves consistently with what is sent to the backend (trimmed).",
        "Maintenance amount dirty-check compares numeric values (e.g., '1500' and '01500' should be treated as the same amount)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the secretary Settings page baseline state is not stale across settings refetches or identity/actor changes, so the dirty-check reflects the currently loaded backend settings for the current logged-in principal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The bug is still there where the secretary's profile settings is not being saved saying nothing to change"
        ]
      },
      "acceptanceCriteria": [
        "When the query `useGetSecretarySettings()` returns new settings (e.g., after a successful save + invalidation/refetch, or after logging out and logging in as another user), the form’s baseline used for dirty detection updates to match the latest fetched settings as long as the user does not currently have unsaved edits.",
        "After saving successfully, the form fields and baseline both reflect the saved (normalized) values, and subsequent renders do not revert the Save button back to a disabled state incorrectly."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep the backend as a single Motoko actor (no new backend services)."
  ],
  "nonGoals": [
    "Adding new settings fields beyond maintenance amount, UPI ID, and guard mobile number.",
    "Changing authorization rules for who is allowed to update secretary settings (unless required to fix the specific reported bug).",
    "Implementing persistent backend storage for the uploaded logo (logo is currently localStorage-based and is not part of this bug)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}