{
  "kind": "build_request",
  "title": "Enhance IC mainnet deployment tooling to support retries and cycles readiness checks",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Update the IC mainnet deployment helper tooling to support an explicit retry mode for transient deployment failures (including the known \"CaLM permanent canister reservation failed\" case), so an operator can run one command that retries `dfx deploy --network ic` multiple times with configurable delay and clear console guidance.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Try 2 and 3"
        ]
      },
      "acceptanceCriteria": [
        "A retry-capable entrypoint exists in the repository (either by extending `frontend/deploy/ic-deploy-with-retry.sh` or adding a new script in `frontend/deploy/`) that re-attempts `dfx deploy --network ic` for a configurable number of tries and delay between tries.",
        "When a deploy attempt fails due to \"CaLM permanent canister reservation failed\", the tooling prints the existing recommended next steps (including pre-creating canisters) and then continues according to the configured retry behavior.",
        "When all retries are exhausted, the tooling exits non-zero and prints a concise summary indicating the last failure reason and where to find troubleshooting docs."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a pre-deployment cycles readiness check to the deployment helper flow so operators are guided to verify cycles/wallet availability before attempting IC mainnet deployment, with clear English-only instructions and commands to run when cycles are missing or not configured.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Try 2 and 3"
        ]
      },
      "acceptanceCriteria": [
        "The deployment helper flow includes a cycles/wallet readiness check step (either automated or an explicit prompted step) before running `dfx deploy --network ic`.",
        "If cycles/wallet readiness cannot be verified automatically, the tooling prints exact commands the operator can run to verify cycles/wallet configuration and balance, and then aborts safely with a non-zero exit code.",
        "Documentation is updated to include an English-only section explaining the cycles readiness check and what to do if cycles are insufficient."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or `frontend/src/components/ui`.",
    "Keep all Motoko backend logic in the single actor (`backend/main.mo`); do not introduce additional backend services."
  ],
  "nonGoals": [
    "Guaranteeing mainnet deployment success in the presence of IC capacity issues outside the project’s control.",
    "Changing application product features, UI/UX, or backend data models unrelated to deployment tooling.",
    "Adding third-party deployment services or external CI/CD providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}