{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Draft/Preview non-blank startup fallback, diagnostics, and SW cache invalidation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an HTML-level startup fallback in index.html that prevents a blank screen and escalates to an error state with Reload and Hard Reload actions if React/JS doesn't mount in time.",
      "acceptanceCriteria": [
        "When opening the Draft/Preview URL, the user always sees either the React app or an HTML fallback screen; there is no fully blank/white screen state.",
        "If the JS bundle fails to load or React fails to mount, the HTML fallback switches to an error state within the configured timeout and shows Reload and Hard Reload (Clear Cache) actions.",
        "Hard Reload from the HTML fallback attempts to unregister service workers and clear Cache Storage, then reloads the page."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Implement a pre-React HTML fallback UI (inline markup + minimal styling) that is visible immediately, starts in a \"Starting…\" state, and transitions to an \"App failed to start\" error state after a 5–10s timeout if the React app hasn’t mounted. Include two plain-HTML actions: (1) Reload (standard location reload) and (2) Hard Reload that best-effort unregisters service workers and clears Cache Storage before reloading."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Signal successful React bootstrap as early as possible (e.g., dispatch a global browser event or set a global flag from a top-level effect) so the index.html fallback can hide/remove itself immediately after React mounts, ensuring no visual interference once the app is running."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add non-React startup diagnostics (console + HTML hint) for errors occurring before React mounts, ensuring all user-visible text is English.",
      "acceptanceCriteria": [
        "If an error occurs before React mounts, it is logged to the browser console and the HTML fallback shows a short English message indicating startup failed (without exposing sensitive data).",
        "If no error occurs and React mounts successfully, the HTML fallback is removed/hidden and does not visually interfere with the app."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add early startup diagnostic hooks that work without React: log critical bootstrap failures via window.onerror and unhandledrejection to the console, and update the HTML fallback with a short, generic English hint when such errors occur (avoid exposing stack traces or sensitive details in the UI, but keep details in console). Ensure the fallback is hidden/removed when the React-mounted signal is received."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Invalidate service worker caches by bumping CACHE_NAME and ensure the fetch handler never returns cached index.html for non-navigation requests (scripts/styles/assets/modules).",
      "acceptanceCriteria": [
        "Service worker CACHE_NAME is updated to a new version string (e.g., vision-galaxy-v3).",
        "JS/CSS/module/image requests are never fulfilled by cached index.html; only true navigation/document requests may fall back to cached index.html.",
        "After a hard reload, the client installs/activates the new service worker cache version and the Draft/Preview page loads without a blank screen."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sw.js",
          "operation": "modify",
          "description": "Bump CACHE_NAME to a new version and tighten fetch handling so that only true navigation/document requests may fall back to cached index.html. Add explicit guards to prevent any script/style/module/image/font (non-navigation) requests from being served cached index.html, even if a cache match exists."
        }
      ]
    }
  ]
}