{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "IC mainnet deployment helper retries and cycles readiness checks",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add an explicit retry mode to the IC mainnet deployment helper so operators can re-attempt `dfx deploy --network ic` multiple times with configurable delay and clear console guidance, including continued retries after the known CaLM failure.",
      "acceptanceCriteria": [
        "A retry-capable entrypoint exists in the repository (either by extending `frontend/deploy/ic-deploy-with-retry.sh` or adding a new script in `frontend/deploy/`) that re-attempts `dfx deploy --network ic` for a configurable number of tries and delay between tries.",
        "When a deploy attempt fails due to \"CaLM permanent canister reservation failed\", the tooling prints the existing recommended next steps (including pre-creating canisters) and then continues according to the configured retry behavior.",
        "When all retries are exhausted, the tooling exits non-zero and prints a concise summary indicating the last failure reason and where to find troubleshooting docs."
      ],
      "file_operations": [
        {
          "path": "frontend/deploy/ic-deploy-with-retry.sh",
          "operation": "modify",
          "description": "Extend the script to implement an explicit retry mode around `dfx deploy --network ic`, including: configurable number of tries and delay (via flags and/or environment variables), attempt counters and clear console messages, preservation of per-attempt failure output for diagnostics, CaLM failure detection that prints the existing recommended next steps (including running `./frontend/deploy/ic-precreate-canisters.sh`) and then continues retrying per configuration, and a final non-zero exit with a concise summary (last failure reason + reference to `frontend/docs/deployment-troubleshooting.md`)."
        },
        {
          "path": "frontend/deploy/README.md",
          "operation": "modify",
          "description": "Update documentation for the deployment helper to describe the new explicit retry mode: how to invoke it, how to configure tries/delay, what is printed on each attempt, what happens on CaLM reservation failures, and what summary is shown when retries are exhausted."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add a pre-deployment cycles/wallet readiness check to the IC mainnet deployment helper flow, with English-only instructions and exact commands to run when readiness cannot be verified or cycles are missing.",
      "acceptanceCriteria": [
        "The deployment helper flow includes a cycles/wallet readiness check step (either automated or an explicit prompted step) before running `dfx deploy --network ic`.",
        "If cycles/wallet readiness cannot be verified automatically, the tooling prints exact commands the operator can run to verify cycles/wallet configuration and balance, and then aborts safely with a non-zero exit code.",
        "Documentation is updated to include an English-only section explaining the cycles readiness check and what to do if cycles are insufficient."
      ],
      "file_operations": [
        {
          "path": "frontend/deploy/ic-deploy-with-retry.sh",
          "operation": "modify",
          "description": "Add a pre-deployment cycles/wallet readiness check step executed before the first deploy attempt. Prefer an automated check using `dfx` commands to detect whether an IC wallet is configured and whether a balance can be read; if the check cannot be verified automatically, print English-only, exact commands the operator should run to verify wallet configuration and cycles balance (for IC mainnet), then abort safely with a non-zero exit code without attempting deployment."
        },
        {
          "path": "frontend/deploy/README.md",
          "operation": "modify",
          "description": "Add an English-only section documenting the cycles/wallet readiness check: what it verifies, what the helper does when verification fails, and the exact commands operators should run to confirm wallet configuration and cycles balance before retrying deployment."
        },
        {
          "path": "frontend/docs/deployment-troubleshooting.md",
          "operation": "modify",
          "description": "Update the troubleshooting guide with an English-only section describing the new cycles readiness check step, including what to do when cycles are missing/insufficient or a wallet is not configured, and include the exact `dfx` commands referenced by the deployment helper."
        }
      ]
    }
  ]
}