{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Startup auth gate: fail-fast error UI with retry, logout, and hard reload recovery",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Prevent app startup from hanging by rendering a clear startup error UI when loading the caller user profile fails, with Retry and Logout recovery actions.",
      "acceptanceCriteria": [
        "If `getCallerUserProfile` fails (network error, canister error, or actor not available), the app shows an error screen instead of an infinite loading state.",
        "The error screen contains user-facing text in English that indicates the app failed to load required data and suggests trying again.",
        "The error screen provides a “Retry” action that re-attempts loading the profile (via React Query refetch/invalidation).",
        "The error screen provides a “Logout” action to allow the user to re-authenticate if the identity/session is in a bad state.",
        "When the backend becomes reachable again, using “Retry” successfully proceeds into the app without requiring a full page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StartupErrorScreen.tsx",
          "operation": "create",
          "description": "Create a dedicated startup error screen component that displays an English error message for failed profile load, and includes actions for “Retry” (calls provided callback) and “Logout” (calls provided callback). Use existing shadcn-ui components (e.g., Card/Alert/Button) without modifying anything under `frontend/src/components/ui`. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the startup/auth gate in RootComponent to handle `useGetCallerUserProfile()` failures and non-fetched/actor-unavailable states without showing an indefinite spinner. Render the new StartupErrorScreen when the profile query is in an error state (and for best-effort actor-not-available startup failure), and wire up: Retry to React Query refetch/invalidation of `['currentUserProfile']`, and Logout to `useInternetIdentity().clear()` plus `queryClient.clear()` so the user can re-authenticate. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Provide a “Hard reload” recovery action in the startup error UI that clears relevant caches (including service worker caches) and reloads safely.",
      "acceptanceCriteria": [
        "The startup error UI includes a “Hard reload” action.",
        "“Hard reload” clears Cache Storage entries created by the app (best-effort) and then reloads the page.",
        "If a service worker is registered, the hard reload flow attempts to unregister it (best-effort) before reloading.",
        "The hard reload flow does not throw uncaught exceptions if any operation fails (e.g., permissions, unsupported APIs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/hardReload.ts",
          "operation": "create",
          "description": "Implement a safe, best-effort `hardReload()` helper that (1) attempts to delete app Cache Storage entries (e.g., caches with app-specific names/prefix), (2) attempts to unregister any registered service workers, and (3) reloads the page. Ensure all operations are guarded with feature detection and try/catch so failures never throw uncaught exceptions."
        },
        {
          "path": "frontend/src/components/StartupErrorScreen.tsx",
          "operation": "modify",
          "description": "Add a “Hard reload” action/button to the startup error UI and wire it to call the `hardReload()` helper. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the startup error state rendered from the auth gate includes the “Hard reload” action (via StartupErrorScreen) as a client-side recovery option for PWA/service worker cache or bad client state scenarios. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}