{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix secretary settings dirty-check normalization and baseline refresh behavior",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Normalize secretary settings values for reliable dirty-checking and correct Save button enabled/disabled behavior.",
      "acceptanceCriteria": [
        "On `frontend/src/pages/secretary/SettingsPage.tsx`, after changing any of the three configuration inputs from their currently loaded values, the Save Configuration button becomes enabled (unless validation errors exist).",
        "The “No changes to save” helper text only appears when the currently displayed input values are effectively identical to the last loaded/saved values (after normalization such as trimming text fields and comparing the maintenance amount numerically).",
        "If the user types leading/trailing spaces into UPI ID or Guard Mobile Number, the dirty-check uses trimmed values so that saving behaves consistently with what is sent to the backend (trimmed).",
        "Maintenance amount dirty-check compares numeric values (e.g., '1500' and '01500' should be treated as the same amount)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/secretary/SettingsPage.tsx",
          "operation": "modify",
          "description": "Update dirty-check logic to compare normalized values: trim UPI ID and guard mobile number, and compare maintenance amount numerically/canonically so equivalent inputs (e.g., '01500' vs '1500') are treated as identical. Ensure the Save Configuration disabled state and the “No changes to save” helper text are driven by this normalized comparison."
        },
        {
          "path": "frontend/src/utils/settingsValidation.ts",
          "operation": "modify",
          "description": "Add/adjust shared normalization helpers (e.g., trimming text fields and canonicalizing maintenance amount) that can be reused by SettingsPage for dirty-checking consistency with what is submitted. Keep validation behavior intact while enabling numeric-canonical comparisons in the UI."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the Settings page dirty-check baseline updates correctly on refetches and identity/actor changes without clobbering unsaved edits.",
      "acceptanceCriteria": [
        "When the query `useGetSecretarySettings()` returns new settings (e.g., after a successful save + invalidation/refetch, or after logging out and logging in as another user), the form’s baseline used for dirty detection updates to match the latest fetched settings as long as the user does not currently have unsaved edits.",
        "After saving successfully, the form fields and baseline both reflect the saved (normalized) values, and subsequent renders do not revert the Save button back to a disabled state incorrectly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/secretary/SettingsPage.tsx",
          "operation": "modify",
          "description": "Refactor the settings initialization effect so the baseline and form fields can refresh when `useGetSecretarySettings()` returns updated data (including after query invalidation/refetch and actor/identity changes), but only when there are no unsaved edits based on the normalized dirty-check. After a successful save, set both baseline and inputs to the normalized saved values so the UI remains stable across subsequent refetches."
        }
      ]
    }
  ]
}